parser/src/test/resources/net/www_eee/util/serialization/parser/xml/soap/departures_ignore_extra.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header>
    <w:stuff xmlns:w="http://www_eee.net/ns/">
      <w:ignore>Some text and stuff to ignore.</w:ignore>
    </w:stuff>
    <w:departureYear xmlns:w="http://www_eee.net/ns/">2001</w:departureYear>
  </env:Header>
  <env:Body>
    <w:departures xmlns:w="http://www_eee.net/ns/">
      <w:ignore>Some text and stuff to ignore.</w:ignore>
      <w:departure>
        <w:departing>Canada</w:departing>
        <w:departureMonthDay>--01-01</w:departureMonthDay>
      </w:departure>
      <w:ignore>Some text and stuff to ignore.</w:ignore>
      <w:departure>
        <w:departing>USA</w:departing>
        <w:departureMonthDay>--02-01</w:departureMonthDay>
      </w:departure>
      <w:departure>
        <w:ignore>Some text and stuff to ignore.</w:ignore>
        <w:departing>Australia</w:departing>
        <w:departureMonthDay>--03-01</w:departureMonthDay>
      </w:departure>
    </w:departures>
  </env:Body>
</env:Envelope>
